{"/about/":{"data":{"":"","credits#Credits":"Our vision is to build the best native app experience\non the Windows and Xbox platforms by adopting the latest technology provided by Microsoft. on the iOS, iPadOS and TvOS provided by Apple. Support the projects by\nSharing the apps with the community Purchasing the Pro version Leaving 5-star ratings in the store Buy me a coffee To follow the app development updates, we will soon open a Telegram announcement channel.\nCredits\rApps can not be built without the following tools and inspirations:\nJson.NET WinUI 2 Windows Community Toolkit LibVLCSharp VLCKit FFmpeg ReverseMarkdown "},"title":"About"},"/blog/":{"data":{"":"\rRSS Feed "},"title":"Blog"},"/docs/":{"data":{"":"","features#Features":"","next#Next":"👋 Hello! Welcome to the JimmyRespawn documentation!\nWhat is JimmyRespawn?\rJimmyRespawn is a software publisher dedicated to delivering high-quality native apps. for the iOS, Windows and Xbox platforms, leveraging the latest Microsoft technologies to enhance user experiences.\nFeatures\rBeautiful Design - Inspired by Fluent guideline to offer a modern design that makes app look outstanding. Responsive Layout and Dark Mode - It looks great on all devices, from mobile, Xbox, tablet to desktop. Dark mode is also supported to accommodate various lighting conditions. Fast and Lightweight - Powered by Swift or UWP, a lightning-fast software infrastructure built with Swift or .Net native, JimmyRespawn keeps its footprint minimal. No extra EXE installation are needed to use it. Multi-language - Multi-language apps made easy with JimmyRespawn’s multilingual mode. Questions or Feedback?\r❓\rJimmyRespawn’s apps are still in active development. Have a question or feedback? Feel free to open an issue!\rNext\rDive right into the following section to get started:\nGetting StartedLearn how to download apps using Store","questions-or-feedback#Questions or Feedback?":"","what-is-jimmyrespawn#What is JimmyRespawn?":""},"title":"Documentation"},"/docs/download-manager/":{"data":{"":"","#":"Download Manager is a native download application for Windows 10/11, designed with a Fluent interface.\nThe motivation behind developing this application stemmed from the lack of a lightweight downloader with a native UWP interface between the Aria-wrapped GUI and traditional IDM. Additionally, I personally needed an out-of-the-box download manager, which led to the creation of this app.\nNext, I will introduce how to use this application.\nGet started\rConfigurations\rPro feature\rUpdate log\rDownload link\ror use winget command winget install 9mx6kd8wgwgp in terminal -\u003e Then enter y."},"title":"Download Manager"},"/docs/download-manager/configurations/":{"data":{"":"","browser#Browser":"Settings Overview in Download Manager\nGeneral\rTheme\rThe app supports Light, Dark, and Auto themes.\nEnable Notifications\rThe app will send system Toast notifications when a download is completed.\nChange Language\rThe app supports around 20 built-in languages. If the change does not take effect, it may indicate that the corresponding language pack is not installed on your system.\nDownloads\rDownload UA (User-Agent)\rYou can modify the User-Agent in cases where certain platforms impose restrictions.\nChange Download Directory\rYou can change the default download location; previously downloaded files will not be affected.\nMulti-threading\rSupports up to 5 simultaneous threads per file, accelerating download speeds.\nBatch Download\rIf multiple online files need to be downloaded in bulk and their file extensions follow a certain pattern, you can use the batch wildcard feature to download them all at once.\nBrowser\rFile Type Detection\rThe built-in browser supports detecting various file types. If there are more specific file types, you can manually add them, typically separated by a space, such as mp2 m4a.\nBrowser Engine\rThe app offers Webview1 and Webview2 as engines for detecting download links within the built-in browser. Typically, this setting does not require modification.","downloads#Downloads":"","general#General":""},"title":"Configurations"},"/docs/download-manager/dmkpro/":{"data":{"":"","pricing#Pricing":"\rWhat Features Are Included?\rPermanently remove ads Enable multi-threaded downloading Cloud sync browser bookmarks Allow theme to follow system settings Batch download with wildcards Detect more file types Customize search engines (PC) Preview video media while downloading More exclusive features in future updates Pricing\r$4 USD, currency will be changed depending on your Store region License for 10 devices (can transfer licenses via Microsoft account) ","what-features-are-included#What Features Are Included?":""},"title":"Pro feature"},"/docs/download-manager/get-started/":{"data":{"":"","1-how-to-start-downloading#1. How to start downloading":"","2-in-app-browser#2. In-app Browser":"","3-file-manager#3. File Manager":"","4-application-principle#4. Application Principle":"If you want to learn more about the Download Manager, please take your time to go through the following documentation.\n1. How to start downloading\rMethod 1: In the “Downloads” tab, click the + button at the bottom right or top right corner to directly open a popup where you can input the download link. Simply enter the hyperlink you want to download.\nMethod 2: If you prefer to have a popup appear when clicking on downloadable files while browsing, it is recommended to use the in-app browser.\nMethod 3: Extensions, currently under development.\n2. In-app Browser\rThe Download Manager includes a built-in browser designed for sniffing out downloadable files from complex pages. This prevents scenarios where the default download link might lead to misleading executable files. For detailed usage instructions, see the “In-app Browser” section.\nP.S. Don’t worry, this is not a Chromium wrapper; it uses Windows’ built-in Edge WebView 2, so it won’t take up additional app space.\nP.S.2 Please be aware of the safety of the download platform. DMK itself does not check whether the downloaded file contains threats. Although the system’s default antivirus software will scan the file after the download is complete, it may mistakenly associate the downloader with the file.\n3. File Manager\rThe app includes a built-in file manager for managing downloaded files, supporting common file management functions such as opening, copying, moving, and renaming. However, it can only manage files within the download folder. Due to UWP sandboxing, files outside the download folder cannot be accessed or managed by the app.\n4. Application Principle\rAdvantages: The app uses the .Net Native Download Operation, which means the Download Manager uses truly native download threads, resulting in an extremely lightweight and fast experience."},"title":"Get started"},"/docs/download-manager/updatelog/":{"data":{"":"","v1546#v1.5.46":"v1.5.51\rDate：TBD\nImprovement: More native UI improvement in list Bug fixes: Fix videos download v1.5.50\rImprovement: Some UI adjustment at the bottom v1.5.49\rDate：2025/2/3\nBug fixes: Fix videos download v1.5.48\rDate：2024/1/3\nImprovement: UI adjustment in settings v1.5.47\rDate：2024/9/30\nBug fixes: Fix videos download v1.5.46\rDate：2024/9/6\nFeature: Add menu option Feature: Add more info documentation Bug fixes: fix some circumstances while timer not take effect ","v1547#v1.5.47":"","v1548#v1.5.48":"","v1549#v1.5.49":"","v1550#v1.5.50":"","v1551#v1.5.51":""},"title":"Update log"},"/docs/iptv/":{"data":{"":"","introduction#Introduction":"","qa-trouble-shoot#Q\u0026amp;A Trouble shoot":"Introduction\rIPTV Fluent is a powerful software solution designed for seamless IPTV streaming and management.\nThis section covers tutorial how to use IPTV Fluent.\nGet-Started\rConfigurations\rWhat's in IPTV Plus\rUpdate log\rHow to use?\rSimply type any m3u links you found online into [Search channels m3u/8 link] on the left and press Enter. Where can I find m3u link?\rType ‘iptv’ into github search section. Or type ‘m3u links’ on any search engine.\nTerms of Service\rIPTV Fluent does not host or distribute any content or re-direct you to any reseller. Please find m3u8 or m3u link provided by other legal IPTV providers.\nDownload Link\rWindows \u0026 Xbox version:\nor use winget command winget install 9PKMDLWBC8ZJ in terminal -\u003e Then enter y.\niOS \u0026 iPad version：\nor scan QR code to download for free:\nQ\u0026A Trouble shoot\rInstant crash after loading channels\rPlease install the graphic driver on the device. The app uses software decoder and hardware decoder to play video.\nUnable to streaming video in background\rYou may exit the playing page to library page in order to release the video comsumption, then direct the app to the background.\nVideo glitch during streaming\rSwitch playback engine in Settings.\nRandom crash while switching between channels\rDitto. VLC might crash if there is bad connection during the channel switch.\nUnable to parse the channel list\rThere are two circumstances:\n1.The M3U/8 list does not follow the guideline. There is nothing we can do about this.\n2.Our parsing logic is unable to parse the list. Please send the list to us via mail if it’s convenient for you.\nDefault system players does not load user agent required channel\rCurrently only other two video engines support user agent required channel. Please change video playback engine in settings if you wish to play channels like this.\nIs there mobile version for IPTV Fluent\riOS and iPad verison is available at app store. Click here to download for free.\nMedia Hub for Emby, Jellyfin and WebDAV\rStarting at v1.0.34 for Windows \u0026 Xbox version. The app supports Emby, Jellyfin, WebDAV and DLNA as media servers.\nAccess it by clicking the top right botton in the Library Page.\nThe media info is accessible for Emby and Jellyfin servers. Currently there is no modification for poster wall yet. We’ll see how it performs as media player now.\nThe app is aiming to be a multi-media hub as Infuse and Kodi did in iOS and Android.\nP.S. On console the app is using server transcoding for 4K HEVC videos due to codec issue. Other videos are using the native hardware decode.\nHow to launch on startup or pin it to desktop\rFollow this instruction: Tutorial here."},"title":"IPTV"},"/docs/iptv/configurations/":{"data":{"":"","general-settings#General settings":"","list-settings#List settings":"","menu-layout#Menu layout":"","playback-settings#Playback settings":"","playlist-sync#Playlist sync":"","read-more#Read More":"Though IPTV Fluent is ready to play streaming as long as you have personal IPTV Provider, but still it offers powerful customization settings.\nMenu layout\rTo adjust settings in IPTV Fluent, simply click Settings button on the left menu.\nIPTV Fluent\rLive TV\rChannels\rLibrary\rSettings\rGeneral settings\rLaunch menu\rThere are Live TV, Channels, Library, MediaHub and Big Picture. After launching the app, it’ll immediately open the option you choose.\nApp language\rThere are 21 language options in the app.\nExcept English, French, Spanish, Turkish and Chinese, other language is translated by AI and machine. Join the translation group to help us translating the app.\nIf your OS does not have the language pack, the app language won’t show up in settings.\nPlaylist sync\rOnline playlist and favorite list added by users can be synced between devices like desktop and tablet via OneDrive.\nYou have to manually click upload and download between devices. Auto sync is under development.\nCurrently this feature is only available for IPTV Plus.\nPlayback settings\rPlayback engine\rPlayback engine is the core player behind streaming. If you encounter any issue while playing some live stream, you may change the playback engine.\n1: VLC has better graphics and source playbility support.\n2: Native system player has better RAM memory usage management and stability management.\n3: FFMpeg has better stream support but consume more RAM memory usage.\nElectronic programme guide\rCustom epg required a external xml link which may be provided by your IPTV Provider or you may search it online.\nIt will display upcoming programmes after url has been setted.\nAuto sleep\rApp supports auto shut down after certain amount time.\nList settings\rDefault list view\rIn channel list, default it displayed as single line list.\nThere is an Grid option to show it with programme logo.\nAuto detect latency\rThere may be some situations which you retrieve unreliable m3u list online.\nMany of the channels within it may be unavailable in your region.\nTurn on this feature will auto hide those channels after loading the online list.\nUpdate frequency\rEvery day, Every month option enables cache the online list every day or every month without loading the list every time.\nRead More\rWiki: Electronic program guide "},"title":"Configurations"},"/docs/iptv/get-started/":{"data":{"":"","1-what-is-an-iptv-player#1. What is an IPTV Player":"","2-what-is-m3u-and-where-to-get-it-legitimately#2. What is M3U, and Where to Get It Legitimately":"","3-how-to-use-m3u-in-iptv-fluent#3. How to Use M3U in IPTV Fluent":"","read-more#Read More":"Please be patient if you are new to IPTV. IPTV Fluent does not provide in-box TV channels.\n1. What is an IPTV Player\rAn IPTV Player is a software tool that allows users to stream television content over the internet.\nIt supports various formats for live channels and video-on-demand content, providing a flexible interface to browse and watch media from around the world.\n2. What is M3U, and Where to Get It Legitimately\rM3U is a playlist file format commonly used to store IPTV channel lists.\nIt contains URLs for streaming content and can be obtained from legitimate sources like licensed IPTV providers or broadcasters.\nAlways ensure you are using legally acquired M3U files to avoid copyright violations.\n3. How to Use M3U in IPTV Fluent\rTo start using IPTV Fluent, simply enter the M3U URL in the search bar.\nThe software will automatically load the channels and content associated with the M3U file, allowing you to browse and stream with ease.\nRead More\rIPTV m3u list example in Github IPTV history by Wikipedia "},"title":"Get Started"},"/docs/iptv/iptvplus/":{"data":{"":"","full-feature-list-offered-by-plus#Full feature list offered by Plus":"IPTV Plus has enhanced features built for IPTV Fluent.\nWhat’s so special?\rSo what’s the diffrence IPTV Plus from other IPTV apps on Windows you may ask.\nIPTV Fluent and Plus are constantly receiving new features and bug fixes during the development.\nWhat does Plus offer?\rPricing\rIPTV Plus offer 2 options. Lifetime and Subscription.\nFor subscription it will cost $0.99(VAT excluded) for 10 devices license. Plus feature will be locked after subscription expired. For lifetime it will cost $12(VAT excluded) for 10 devices license. The plus function offered in two versions is identical.\nSubscription cancellation\rSign into account via official msft page to cancel the IPTV plus.\nMicrosoft Subscription\nFull feature list offered by Plus\rOffering 19+ exclusive PLUS features:\nPlayback\nAuto sleep timer Save screenshots Import external subtitles via URL or local file Open with multiple channels at the same time EPG\nEPG support and search channels or programmes EPG for the single channel Playlists\nAdd channels to favorite or local lists Multiple online playlists setup Export playlists Cache lists with Every day or Every month Mediahub\nSet more than 2 media sources Modify poster wall for Emby or Jellyfin Full codec playback support Pin media source to the Start menu Other\nSync favorite and online lists via OneDrive Remove advertisement Gamepad controls optimization | Manually enable required OLED burn-in preventor Force refresh for online lists Support the developer ","pricing#Pricing":"","subscription-cancellation#Subscription cancellation":"","what-does-plus-offer#What does Plus offer?":"","whats-so-special#What\u0026rsquo;s so special?":""},"title":"IPTV Plus"},"/docs/iptv/updatelog/":{"data":{"":"","v1014#v1.0.14":"IPTV Fluent is constantly receiving updates and in active development right now.\nv1.0.47\rRelease date: TBD\nFeature: Debugger for failing to grab a list or play a channel Pro Feature: Backup and restore the app data in local file Pro Feature: Customize unique option for each online list v1.0.46\rRelease date: 2026/2/12\nImprovement: Add fill video aspect ratio option Improvement: New audio delay control slider give better and more accurate options Improvement: New custom speed rate control slider give better and more accurate options Improvement: New sleep timer picker give better and more accurate options Bug fixes: Fix crash while in-app notification pop up Bug fixes: Fix ‘archivelist’ showing up in the add to list menu v1.0.45\rRelease date: 2026/1/20\nFeature: Enable EPG in the menu bar on the left via settings Feature: (VLC) Option to change play control panel to the top via settings Bug fixes: Fix archive feature not enabled for some users v1.0.44\rRelease date: 2025/11/28\nBug fixes: Fix some failure of downloading playlists under XC v1.0.43\rRelease date: 2025/11/13\nPro Feature: Archive an online list if you want to keep it but not show in the main list Improvement: Continuous play after video end for local video in media hub Improvement: (FFMPEG) Enable OLED burn-in preventor button Improvement: Improve pinned speed for the first time under Win 11 Improvement: Some UI adjustment and translation completion Bug fixes: Fix some failure of downloading EPG when the EPG is a huge list Bug fixes: Fix the app freezes while downloading a big list in the standalone EPG page Bug fixes: Fix the failure of downloading channel list from some short url sites like shortio, etc Bug fixes: Fix the top-right button color not changing while auto theme switched Bug fixes: Fix the app crash while some circumstances during changing media source’s server type v1.0.42\rRelease date: 2025/10/24\nImprovement: Provide higher-resolution icons Improvement: On the EPG page, quickly navigate to a specific page by tapping the number Improvement: (FFMPEG|System Engine) Take a snapshot by right-clicking Bug fixes: (PC) Fix an issue where failing to navigate or playing a channel after clicking a pinned tile while the app was open Bug fixes: (PC) Fix an issue where some channels could not be pinned to Start Bug fixes: (Console) Remove the language options in settings that do not match the system v1.0.41\rRelease date: 2025/9/25\nFeature: Cache management for checking and clear temp files Improvement: Online list in library gets new vertical view switch Improvement: Add header in narrow state window for better readability Bug fixes: (VLC) Inaccurate progress slider’s position under some circummenstances Bug fixes: (VLC) Volume changing doesn’t work while video paused v1.0.40\rRelease date: 2025/8/27\nPro Feature: (PC|VLC|Beta) Recording video and save into video file | Free during beta Pro Feature: Force refresh for missing channels in COG icon Feature: (VLC|FFMPEG) Customize Playback options in order to add referrer, user-agent, etc Feature: (Beta) Play seek support for older programmes (Server is required to support old programmes | Channels have to be added into favorite) Improvement: Testing new Undo button when unlike channel accidentally Improvement: (VLC) Adjust some icons to represent the features more accurately and native Improvement: UX with some items with horizontal scroll actions v1.0.39\rRelease date: 2025/8/4\nPro Feature: (PC|Beta) Play a channel in new Window Improvement: Cache in local for FTP server by right clicking file Improvement: Minor UI tweaks Bug fixes: Display correct channel name while using remote control for dialing numbers Bug fixes: Fix some circumstances which unable to play videos in ftp server v1.0.38\rRelease date: 2025/7/14\nFeature: (PC) New Remote Control option in Settings to enable remote control or air mouse navigation Pro Feature: Open channels with the system media player or VLC UWP — right-click a channel in the Channels page Improvement: Set preferred subtitle track for VOD playback Improvement: Improved translations in some languages Bug fixes: Corrected time offset for channels on the EPG page Pro Feature: Option to force server-side transcoding for Jellyfin and Emby Bug fixes: Fixed black poster images in poster view for Jellyfin and Emby Bug fixes: Fixed incorrect episode order for Jellyfin and Emby v1.0.37\rRelease date: 2025/7/1\nFeature: New fullscreen big picture mode available in settings Pro Feature: Poster wall modification for Jellyfin and Emby Feature: Search in Poster wall for Jellyfin and Emby Feature: Cross platform resume play in Poster wall for Jellyfin and Emby Feature: Genre view for Jellyfin and Emby Feature: Unplayed mark in poster view, mark videos played and favorited for Jellyfin and Emby Improvement: Enhanced fullscreen touch device control and navigation Improvement: Better gamepad control on PC Improvement: Launche menu includes Media hub available for all users Bug fixes: Episodes order correction in Series Page for Jellyfin and Emby Bug fixes: Unusual occassion entering an episode detail after crashing for Jellyfin and Emby Bug fixes: Typo fix v1.0.36\rRelease date: 2025/6/22\nFeature: Support complete Jellyfin or Emby’s poster wall with genre types Improvement: Some typo fixes Major Bug fixes: Fix some XC M3U lists won’t be downloaded v1.0.35\rRelease date: 2025/6/19\nFeature: (Console) Support 4K HEVC Codec video on Emby or Jellyfin server by using server transcoding Pro Feature: (Beta) Movie/TV wall view for Jellyfin and Emby media servers Pro Feature: (PC) Quick guide for system video codec downloads Pro Feature: (PC) Pin media server to start menu Improvement: More native Turkish translation special thanks to community numbers! Bug fixes: Hide the language in settings which is not supported by the system v1.0.34\rRelease date: 2025/6/8\nFeature: (Beta) New media hub for Jellyfin, Emby and FTP as media servers Feature: (Beta) Enable auto scan Jellyfin or WebDAV media server in local network Feature: (Beta) Auto load external subtitles in Jellyfin or Emby media server Feature: Add disable tap to pause preventing from accidentally pause the stream or video Improvement: (PC) New keyboard shortcuts including (Ctrl+T)theatre mode, (Ctrl-←)quick rewind, (Ctrl+→)fast forward, (Ctrl+I)video info Improvement: (VLC) Relocate subtitle and audio track selector for better UX Improvement: (VLC) improve video control panel Bug fixes: Fix some issues with loading big list in local M3U files Bug fixes: (FFMPEG) Fix subtitles stack together once added new subtitle Bug fixes: (VLC) Fix unable to load multiple external subtitles Bug fixes: (VLC | PC) Fix the progression lost for VOD when get back to the playing page Bug fixes: (Console) Fix the app locked in the fullscreen after navigating away from the playing page v1.0.33\rRelease date: 2025/5/29\nPro Feature: (Beta) New media hub for DLNA, WebDAV and local as media servers Pro Improvement: Autofill EPG URL under XC if there is no EPG set before Improvement: Add restore lifetime purchase button v1.0.32\rRelease date: 2025/5/19\nPro Feature: Add new every month option for update frequency Feature: Share encrypted channel with expiration date (App install required by other people) Improvement: Auto complete incomplete URL for XCodes Improvement: Improve the parser for M3U lists Improvement: Typo fixes v1.0.31\rRelease date: 2025/5/1\nBug fixes: Fix some lists failed to load channels v1.0.29\rRelease date: 2025/4/16\nFeature: (VLC) Change video scale Feature: (VLC) Change audio delay Feature: (VLC) Allow controls dock at the bottom in experimental feature Improvement: UI improvements in Media Servers folder Improvement: (Console) Optimization for TV overscan \u0026 remove blank border while fullscreen Improvement: (Console) Add FFmpeg playback engine in Settings Improvement: (Console) Add Stalker Portal list support Bug fixes: Fix mouse hidden even side menu is open while fullscreen Bug fixes: Keep lowering the crash possibilities in VLC playback engine v1.0.28\rRelease date: 2025/3/24\nBug fixes(Major fix): Lower the crash posibility in VLC playback engine Bug fixes: Lower the UI freezes after switching to unreponsive channels Experimental feature: VLC add force fresh video option Improvement: Mark EPG’s date in the blade guide v1.0.27\rRelease date: 2025/2/20\nPro Feature: VLC add OLED screen burn-in preventor Feature: VLC add custom video ratio option Feature: VLC add subtitle delay option Improvement: Enhanced loved list management Improvement: Love channel while playing Improvement: Edit the online list Bug fixes: Certain EPG url unable to switch between pages Bug fixes: Loading indicator for changing audio ouput device v1.0.26\rRelease date: 2025/1/20\nFeature: VLC add custom speed options Feature: Pin channel or list to start menu for quick launching Improvement: Add title tooltip for the blade channel menu Improvement: Some UE adjustment Bug fixes: Fix some mis-translation in Italian special thanks to Alessandro Bug fixes: Fix blank genre which might cause crash Bug fixes: Fix unable to purchase life-time plus if the app is under subscription v1.0.25\rRelease date: 2024/11/8\nFeature: Change default online list in Settings Bug fixes: Show title on Live Tile under Win10 v1.0.24\rRelease date: 2024/10/28\nFeature: Pro user can play local videos Feature: Pro user can play media servers videos Bug fixes: Update VLC playback engine core to lower the crash v1.0.23\rRelease date: 2024/9/10\nFeature: Support channels which requires user-agent or referrer Bug fixes: Improve channel list parse v1.0.22\rRelease date: 2024/8/30\nPro Feature: Export multi-selected channels to m3u list locally Feature: Edit channel in local list Adjustment: Better experience when add a channel to local list Adjustment: Minor UI adjustment in EPG page v1.0.21\rRelease date: 2024/8/19\nPro Feature: Add custom auto sleep time in settings Feature: Add Stalker Portal (beta) online list support Feature: Add reorder channel in favorite and local list Bug fixes: Fix some navigation loop v1.0.20\rRelease date: 2024/8/9\nFeature: More language support v1.0.19\rRelease date: 2024/8/2\nBug fixes: Fix unable to switch channel under VLC player engine v1.0.18\rRelease date: 2024/8/2\nFeature: Cache online list Feature: New language support v1.0.17\rRelease date: 2024/7/29\nFeature: Add FFmpeg as video engine Feature: Add Background audio play using native engine Bug fixes: Fix some video playback issue using native engine Bug fixes: UI fixes under small window v1.0.16\rRelease date: 2024/7/26\nFeature: Add Xtream Codes parser Feature: Add txt file parse Feature: Change default list/grid Bug fixes: Blade bar ui fix Bug fixes: Fix some circumstances which stuck in fullscreen Bug fixes: Fix some circumstances which unable to enter compact mode under some channels v1.0.15\rRelease date: 2024/7/22\nPro Feature: Stand alone EPG page Feature: New video info in blade bar Feature: Change stream video track Feature: Change stream audio track Feature: Change stream subtitle Feature: Option to enable hardware decoding Bug fixes: EPG list for different time zones Bug fixes: Video restart after pausing and replaying the VOD v1.0.14\rRelease date: 2024/7/17\nFeature: New ‘LIVE’ icon in video page Feature: New blade right bar in video page Feature: Redeigned EPG list UI in video page Feature: New time finder for VOD in video page Feature: Grid list in channels page with icon Feature: New library page Feature: Rename saved online list in library page Feature: Reorder saved online list in library page Feature: UI tweaks in Settings page Bug fixes: Switch to online list when refreshes in channels page ","v1015#v1.0.15":"","v1016#v1.0.16":"","v1017#v1.0.17":"","v1018#v1.0.18":"","v1019#v1.0.19":"","v1020#v1.0.20":"","v1021#v1.0.21":"","v1022#v1.0.22":"","v1023#v1.0.23":"","v1024#v1.0.24":"","v1025#v1.0.25":"","v1026#v1.0.26":"","v1027#v1.0.27":"","v1028#v1.0.28":"","v1029#v1.0.29":"","v1031#v1.0.31":"","v1032#v1.0.32":"","v1033#v1.0.33":"","v1034#v1.0.34":"","v1035#v1.0.35":"","v1036#v1.0.36":"","v1037#v1.0.37":"","v1038#v1.0.38":"","v1039#v1.0.39":"","v1040#v1.0.40":"","v1041#v1.0.41":"","v1042#v1.0.42":"","v1043#v1.0.43":"","v1044#v1.0.44":"","v1045#v1.0.45":"","v1046#v1.0.46":"","v1047#v1.0.47":""},"title":"Update Log"},"/docs/iptvios/":{"data":{"":"","1-introduction#1. Introduction":"","2-qa-trouble-shoot#2. Q\u0026amp;A Trouble shoot":"1. Introduction\rIPTV Fluent Player for iOS and iPadOS is a powerful software solution designed for seamless IPTV streaming and management.\nThis section covers tutorial how to use IPTV Fluent for iOS and iPadOS.\nGet-Started\rConfigurations\rWhat's in IPTV Plus\rUpdate log\rPrivacy policy\rTerms of service\r1.1 How to use?\rGo to Library at the bottom. Then click add button on the top right. Simply type any m3u links you are provided by the legal IPTV providers into Server address, and press Create.\n2.2 Terms of Service\rIPTV Fluent does not host or distribute any content or re-direct you to any reseller. Please find m3u8 or m3u link provided by other legal IPTV providers. For more information Click here\n2.3 Download Link\ror scan QR code to download for free:\n2. Q\u0026A Trouble shoot\r2.1. Unable to parse the channel list\rThere are two circumstances:\nThe m3u/8 list does not follow the guideline. There is nothing we can do about this.\nOur parsing logic is unable to parse the list. Please send the list to us via mail if it’s convenient for you.\n2.2 Contact Us\rIf you have any questions or concerns about the app, feel free to contact us at: 📧 jimmyrespawn@hotmail.com\n2.3 Translating\rHelp us translating the app by joining the Crowdin group"},"title":"IPTV for iOS"},"/docs/iptvios/configurations/":{"data":{"":"","1-menu-layout#1. Menu layout":"","2-list-settings#2. List settings":"","3-playback-settings#3. Playback settings":"","4-general-settings#4. General settings":"Though IPTV Fluent is ready to play streaming as long as you have personal IPTV Provider, but still it offers powerful customization settings.\n1. Menu layout\rTo adjust settings in IPTV Fluent, simply click Settings button at the tab menu.\nIPTV Fluent\rChannels\rLibrary\rSettings\r2. List settings\r2.1 Auto detect latency\rThere may be some situations which some videos in the server has unreliable internet connect.\nTurn on this feature will auto detect those channels’ latency after loading the online list.\n2.2 Update frequency\rEvery day and Every month options enable cache the online list every day or month without loading the list every time.\n3. Playback settings\r3.1 Playback engine\rPlayback engine is the core player behind streaming. If you encounter any issue while playing some live stream, you may change the playback engine.\n1: VLCKit has better graphics and source playbility support.\n2: Native system player has better RAM memory usage management, stability management and PIP feature.\n3.2 Cellular Warning\rIf the device is under cellular network. The video streaming might cost a handful data plan. It’ll warn you if you open a video under the circumstances.\nBe aware, it will not warn you while playing video.\n4. General settings\r4.2 Launch menu\rThere are Channels and Library. After launching the app, it’ll immediately open the option you choose.\n4.3 Language\rThere are 2 language options in the app. English and Chinese Traditional.\nJoin the Crowdin translation group to help us translating the app."},"title":"Configurations"},"/docs/iptvios/get-started/":{"data":{"":"","1-what-is-an-iptv-fluent-player#1. What is an IPTV Fluent Player":"","2-what-is-m3u-and-where-to-get-it-legitimately#2. What is M3U, and Where to Get It Legitimately":"","3-how-to-use-m3u-in-iptv-fluent#3. How to Use M3U in IPTV Fluent":"Please be patient if you are new to IPTV. IPTV Fluent does not provide in-box channels.\n1. What is an IPTV Fluent Player\rAn IPTV Fluent Player is a software tool that allows users to stream content over the internet.\nIt supports various formats for live channels and video-on-demand content, providing a flexible interface to browse and watch media from around the world.\n2. What is M3U, and Where to Get It Legitimately\rM3U is a playlist file format commonly used to store IPTV channel lists.\nIt contains URLs for streaming content and can be obtained from legitimate sources like licensed IPTV providers or broadcasters.\nAlways ensure you are using legally acquired M3U files to avoid copyright violations.\n3. How to Use M3U in IPTV Fluent\r3.1 To start using IPTV Fluent, simply click Library at the menu bar.\n3.2 Click Create List button or + at the top.\n3.3 Then Click Online List.\n3.4 Type your personal M3U URL into Server address and click Create button on the top right. Input list name or epg URL if you want. They are optional.\n3.5 Click the list you just created and it’ll navigate back to Channels Menu.\n3.6 Click any video/channel you want to watch and Voila, the app will automatically load the channels and content associated with the M3U file, allowing you to browse and stream with ease."},"title":"Get Started"},"/docs/iptvios/iptvplus/":{"data":{"":"","1-whats-so-special#1. What\u0026rsquo;s so special?":"","2-what-does-plus-offer#2. What does Plus offer?":"","3-pricing#3. Pricing":"","4-refund#4. Refund":"IPTV Plus has enhanced features built for IPTV Fluent.\n1. What’s so special?\rSo what’s the diffrence IPTV Plus from other IPTV apps on iOS you may ask.\nIPTV Fluent Player and Plus are constantly receiving new features and bug fixes during the development.\n2. What does Plus offer?\rFavorite channels: Add channels to favorite or local list.\nExport list: Export list’s channels as an M3U file to share with others.\nEPG support: Show eletronic programmes for each online list.\nRemove ads: Though there is no ads in the app now. But we’ll consider adding it to make the app sustainable.\nSupport the developer: Help developers keep updating the app.\n3. Pricing\rIPTV Plus offer 1 option currentlly: Lifetime Plus.\nCurrently the Plus price is on sale. It’ll be $5.99 until the app get more exclusive fetures.\nFor lifetime it will cost $5.99(VAT excluded) for 10 devices license.\nDoes not: The purchase does not carry between game console version and iOS/iPadOS version. Plus version will sync between iOS, iPadOS and possibly more Apple ecosystem devices in the future.\n4. Refund\rYou have to contact Apple support to issue a refund since we don’t handle the purchase on our end."},"title":"IPTV Plus"},"/docs/iptvios/updatelog/":{"data":{"":"","v10#v1.0":"IPTV Fluent Player is constantly receiving updates and in active development right now.\nv1.0.13\rRelease date: TBD\nImprovement: Munually add channel into favorites or local list v1.0.12\rRelease date: 2026/2/24\nFeature: Player control lock and rotation lock button Bug fixes: Resolved issue where exiting fullscreen after rotate the device Bug fixes: Resolved issue where unable to rotate right with the device in fullscreen v1.0.11\rRelease date: 2026/2/2\nFeature: Added sleep timer to manually stop the stream Feature: Keyboard shortcuts support—press F to toggle fullscreen, Space to play/pause, and R to refresh the stream Improvement: Small UI tweaks to align with iOS 26 style Bug fixes: Resolved issue where fullscreen would auto-exit after unlocking the device or returning to the player v1.0.10\rRelease date: 2025/11/27\nBug fixes: Fix some failure of downloading playlists under XC v1.0.9\rRelease date: 2025/11/11\nPro Feature: Standalone EPG page which show all epg channels with search channels v1.0.8\rRelease date: 2025/10/16\nFeature: (VLC) Customize Playback options in order to add referrer, user-agent, etc v1.0.7\rRelease date: 2025/9/17\nImprovement: Support for iOS 26 with the all-new Liquid Glass visual style — sleek, fluid, and more immersive v1.0.6\rRelease date: 2025/8/26\nFeature: (Beta) Play seek support for older programmes (Server is required to support old programmes | Direct click older programme in EPG tab under play video page) v1.0.5\rRelease date: 2025/8/4\nFeature: Add subtitle via local or online for VOD streaming Improvement: Tap again to hide playback overlay v1.0.4\rRelease date: 2025/6/12\nImprovement: Performance improvement Feature: Import channels via text Improvement: Favorite multiple channels at once v1.0.3\rRelease date: 2025/6/7\nImprovement: Performance improvement Feature: Grid view for iPhone Improvement: Better export M3U file capabilities v1.0.2\rRelease date: 2025/5/13\nFeature: Add edit online list Improvement: Add refresh current playlist Improvement: Add Chinese Simplified language v1.0.1\rRelease date: 2025/4/30\nBug fixes: Store metadata fix v1.0\rRelease date: 2025/4/29\nInitial Release ","v101#v1.0.1":"","v1010#v1.0.10":"","v1011#v1.0.11":"","v1012#v1.0.12":"","v1013#v1.0.13":"","v102#v1.0.2":"","v103#v1.0.3":"","v104#v1.0.4":"","v105#v1.0.5":"","v106#v1.0.6":"","v107#v1.0.7":"","v108#v1.0.8":"","v109#v1.0.9":""},"title":"Update Log"},"/docs/podcasted/":{"data":{"":"","introduction#Introduction":"Introduction\rPodcasted is an immersive podcast app available on Windows Universal platforms. You can build or import your own podcast library and sync it across devices. The user interface of Podcasted is modern and minimalistic, differentiating itself from old Windows app patterns. It aims to provide an experience rather than just a tool for listening to podcasts.\nGet-Started\rConfigurations\rWhat's in Pro\rUpdate log\rDownload link\ror use winget command winget install 9nxwgr2b1p26 in terminal -\u003e Then enter y."},"title":"Podcasted"},"/docs/podcasted/configurations/":{"data":{"":"","about#About":"Introduction to the “Settings” Features in the Podcasted App\rGeneral\rTheme\rThe app supports light, dark, and automatic themes.\nChange Language\rSupports about 10 built-in languages. If the change does not take effect, it means the corresponding language pack is not installed on the system.\nMenu Position\rThe default menu position is on the left, but it can be moved to the top based on user preference.\nPlayback\rPlayback Speed\rAllows adjusting the audio playback speed within a range of 0.5 to 3.0.\nContinue Playback\rWhen the app is opened, it will resume playing the previously playing content. This feature can be disabled.\nAudio Output\rSupports switching podcast playback to a specific audio device, such as headphones, different amplifiers, or speakers.\nSleep Timer\rAllows podcasts to stop playing after a specified period.\nSync\rOneDrive Sync\rSupports saving playback history and subscriptions to OneDrive for cloud transfer across different devices.\nOPML Sync\rAllows batch importing or exporting of podcast subscriptions via OPML files.\nDownload\rChange Folder\rSupports modifying the preferred location for downloaded podcast episodes.\nAuto Download\rWhen a podcast releases a new episode, it can be automatically downloaded and cached locally.\nDelete After Playback\rLocally cached podcast episodes can be automatically deleted after playback is complete.\nAuto Cleanup\rFor subscribed podcasts, when cached episodes exceed a certain number, they can be automatically deleted.\nSave Podcast Folder Name\rBy default, downloaded files are saved in a folder named after the podcast author. This can be changed to the podcast name.\nInspection\rUnplayed Episodes\rSupports batch querying of the number of unplayed episodes for subscribed podcasts.\nUnplayed Indicator\rWhen enabled, the app will display the number of unplayed episodes for subscribed podcasts upon startup.\nUpdate All Podcast Covers\rSubscribed podcasts may update their icons online, but the local cache retains the original cover from the time of subscription. This feature updates to the latest cover.\nNetwork\rOffline Mode\rWhen enabled, the app will not consume data upon startup. It will only connect to the internet when manually refreshing or downloading podcasts.\nPin\rPin Icon to Star\rQuickly pin the app to the Start menu.\nPin to Taskbar\rQuickly pin the app to the taskbar.\nAbout\rCheck for Updates\rAs the name suggests, checks if there are updates for the podcast app in the Store.\nHotkeys\rDisplays available keyboard and controller shortcut keys.","download#Download":"","general#General":"","inspection#Inspection":"","introduction-to-the-settings-features-in-the-podcasted-app#Introduction to the \u0026ldquo;Settings\u0026rdquo; Features in the Podcasted App":"","network#Network":"","pin#Pin":"","playback#Playback":"","sync#Sync":""},"title":"Configurations"},"/docs/podcasted/get-started/":{"data":{"":" Add a podcast: There are four ways you can add your podcast. The first is simply search and enter a podcast, then click star button. The second is directly paste rss url of the podcast, then the app will directly open the podcast you provided. Thirdly you can upload the favorite list on other devices at Podcasted by OneDrive, download the list back from OneDrvie. Last but not least, you can import OPML files generated by other apps or Podcasted on another device with one click.\nResume Play: The app will save the current episode playing progress when it is being closed. And when you open the app next time on any device with the same account logged in, it’ll continue playing from the recorded time. You may turn this feature off in Settings. (*Xbox won’t sync between pc and mobile)\nSync: Currently the app sync the favorite podcasts and played progression via OneDrive. The app can only manipulate the folder created by it, so you may be feel privacy-free with the app. Entire sync progress is handled by yourself manually. We know it’s dumb right now, but it’s a way to prevent your progress been overrided right now. In future we will implement more smart way to sync your progress.\nPremium: Currently free version provide 5 podcasts subscription with ads in it. Premium will be ads-free and no limitation of podcasts subscription. You need only pay one time on all your Windows/Xbox devices as long as you sign into the same account.\nShortcuts: Both PC and Xbox version support shortcuts. For PCversion: Ctrl + W to quit the app; Ctrl + T to enter compact overlay mode; Ctrl + P to play or pause current playing; Ctrl + F to call search; Ctrl + S to enter Settings page; Ctrl + M to mute or unmute sound. For Xboxversion: Y to call search; X to focus on the play button; View button to open episode detail window.\nFuture: We are expecting at least one time update every month to bring new features to Podcasted. Right now it is just finished basic function of it which brings you immerse into the design of the app. Here is some parts of future planned feature list:\nNotification for new episodes\nSkip at the beginning of the episode\nWe are excited to have you along with the journey in our development cycle, and expecting to bring more awesomeness in future. Take care."},"title":"Get started"},"/docs/podcasted/podcastedpro/":{"data":{"":"","pricing#Pricing":"\rWhat Features Are Included?\rSubscribe more than 5 podcasts Remove advertisement Save multiple playlists Add episodes to custom playlist Support the developer and get more upcoming exclusive features Pricing\r$2.99 USD/Lifetime license License for 10 devices ","what-features-are-included#What Features Are Included?":""},"title":"Pro feature"},"/docs/podcasted/updatelog/":{"data":{"":"","v1732#v1.7.32":"v1.7.48\rRelease Date: 2026/2/5\nFeature: Brand-new Playlists section, now allowing the creation of empty playlists. Feature: Add the legacy sidebar navigation in the settings. Improvement: Podcast titles and creator names are now selectable and can be copied. Improvement: Reduced the delay when pinning to the Start menu. Improvement: Improved UX and on-screen hints in the Discover and podcast list pages. Bug Fix: Fixed an issue where the unplayed count was not fully displayed on the Home page. Bug Fix: Fixed an issue where the ‘New Releases’ not showing for some users. Bug Fix: Fixed an issue where podcast episodes could sometimes not be added to playlists. v1.7.47\rRelease Date: 2026/1/19\nFix: Fix the ads still on for pro users in Discover sections v1.7.46\rRelease Date: 2025/10/22\nFix: Genre and discover pages return the same podcasts whatsoever Fix: Reset app will wipe the Pro version state v1.7.45\rRelease Date: 2025/8/28\nImprovement: Language translation improved Improvement: Better navigation in gamebar widget mode Improvement: Some UX improvement Fix: Some discover page navigation glitch Fix: App freeze after waking up from sleep v1.7.44\rRelease Date: 2025/8/15\nFeature: Brand new discover section with better UI/UX and more frequent podcasts for better discoverbility Improvement: Better in-app notification tip Improvement: New sponsor programme which allows sponsorship podcasts Fix: Hide the language which is not available in the settings Fix: Typo fix and shownotes timeline navigation fix v1.7.43\rRelease Date: 2025/5/9\nFix: UI and minor fixes v1.7.42\rRelease Date: 2025/4/25\nFeature: Change custom playback speed in settings Improvement: Podcast detail page / Library page \u0026 Genre page UI changes Improvement: Search and filter in library episodes Improvement: Delete all favorite episodes by one click Improvement: Console version remove overscan automatically Fix: Console version won’t download by default folder v1.7.41\rRelease Date: 2025/3/31\nFeature: More language(italian support) thanks to Giorgia S. v1.7.40\rRelease Date: 2025/3/17\nFeature: (PC) Game Bar support v1.7.39\rRelease Date: 2025/3/11\nPremium Feature: New web player on the go Feature: New share function allows web quick play Improvement: More detailed introduced the premium feature v1.7.38\rRelease Date: 2025/3/3\nImprovement: Border color for playlists and the play panel Improvement: UI and UE adjustment for Xbox version Fix: Menu re-expaned after switch pages v1.7.37\rRelease Date: 2025/2/22\nFeature: Add episodes to the playlist Improvement: Update new logo Fix: Some settings issues v1.7.36\rRelease Date: 2025/1/7\nFeature: Add menu position replace Feature: Add refresh subs podcast image Fix: Gamepad navigation fix Fix: Download episodes glitch Fix: Unable to open few encrypted podcasts Fix: Some UI issues v1.7.35\rRelease Date: 2024/12/24\nFeature: Added in-app language modification Feature: Added Xbox Immersive Mode Feature: Added Xbox full-screen player interface Optimization: Right-click to cancel listened episodes Optimization: Improved controller navigation ease on some pages Optimization: Enhanced category lists, mini player, podcast, and settings interfaces Optimization: Added shortcut key tutorial Optimization: Refined some icons Fix: Fixed sidebar highlighting errors Fix: Resolved crash when episodes end at certain resolutions v1.7.34\rFeature: Added support for organizing download folders by podcast name Optimization: Improved interface display v1.7.33\rUpdate Date: 2024/9/9\nOptimization: Enhanced settings page layout Feature: Added infinite scroll for podcast categories Fix: Fixed issues where some lists failed to load v1.7.32\rOptimization: Added theme switching without requiring app restart ","v1733#v1.7.33":"","v1734#v1.7.34":"","v1735#v1.7.35":"","v1736#v1.7.36":"","v1737#v1.7.37":"","v1738#v1.7.38":"","v1739#v1.7.39":"","v1740#v1.7.40":"","v1741#v1.7.41":"","v1742#v1.7.42":"","v1743#v1.7.43":"","v1744#v1.7.44":"","v1745#v1.7.45":"","v1746#v1.7.46":"","v1747#v1.7.47":"","v1748#v1.7.48":""},"title":"Update log"},"/showcase/":{"data":{"":"\rProjects powered by JimmyRespawn\rSticky Noter\rMovier\rJimmy Toolbox"},"title":"Showcase"}}