{"/about/":{"data":{"":"","credits#Credits":"Our vision is to build the best native app experience on the Windows and Xbox platforms by adopting the latest technology provided by Microsoft.\nSupport the projects by\nSharing the apps with the community Purchasing the Pro version Leaving 5-star ratings in the store. To follow the app development updates, we will soon open a Telegram announcement channel.\nCredits\rApps cannot be built without the following tools and inspirations:\nJson.NET WinUI 2 Windows Community Toolkit LibVLCSharp FFmpeg Html2Markdown "},"title":"About"},"/blog/":{"data":{"":"\rRSS Feed "},"title":"Blog"},"/docs/":{"data":{"":"","features#Features":"","next#Next":"👋 Hello! Welcome to the JimmyRespawn documentation!\nWhat is JimmyRespawn?\rJimmyRespawn is a software publisher dedicated to delivering high-quality native apps. for the Windows and Xbox platforms, leveraging the latest Microsoft technologies to enhance user experiences.\nFeatures\rBeautiful Design - Inspired by Fluent guideline to offer a modern design that makes app look outstanding. Responsive Layout and Dark Mode - It looks great on all devices, from Xbox, tablet to desktop. Dark mode is also supported to accommodate various lighting conditions. Fast and Lightweight - Powered by UWP, a lightning-fast software infrastructure built with .Net native, JimmyRespawn keeps its footprint minimal. No extra EXE installation are needed to use it. Multi-language - Multi-language apps made easy with JimmyRespawn’s multilingual mode. Questions or Feedback?\r❓\rJimmyRespawn’s apps are still in active development. Have a question or feedback? Feel free to open an issue!\rNext\rDive right into the following section to get started:\nGetting StartedLearn how to download apps using Store","questions-or-feedback#Questions or Feedback?":"","what-is-jimmyrespawn#What is JimmyRespawn?":""},"title":"Documentation"},"/docs/iptv/":{"data":{"":"","how-to-use#How to use?":"","where-can-i-find-m3u-link#Where can I find m3u link?":"IPTV Fluent is a powerful software solution designed for seamless IPTV streaming and management.\nThis section covers tutorial how to use IPTV Fluent.\nGet-Started\rConfigurations\rWhat's in IPTV Plus\rUpdate log\rHow to use?\rSimply type any m3u links you found online into [Search channels m3u/8 link] on the left and press Enter. Where can I find m3u link?\rType ‘iptv’ into github search section. Or type ‘m3u links’ on any search engine.\nTerms of Service\rIPTV Fluent does not host or distribute any content or re-direct you to any reseller. Please find m3u8 or m3u link provided by other legal IPTV providers.\nDownload Link"},"title":"IPTV"},"/docs/iptv/configurations/":{"data":{"":"","general-settings#General settings":"","list-settings#List settings":"","menu-layout#Menu layout":"","playback-settings#Playback settings":"","playlist-sync#Playlist sync":"","read-more#Read More":"Though IPTV Fluent is ready to play streaming as long as you have personal IPTV Provider, but still it offers powerful customization settings.\nMenu layout\rTo adjust settings in IPTV Fluent, simply click Settings button on the left menu.\nIPTV Fluent\rLive TV\rChannels\rLibrary\rSettings\rGeneral settings\rLaunch menu\rThere are Live TV, Channels and Library. After launching the app, it’ll immediately open the option you choose.\nApp language\rThere are 20 language options in the app.\nExcept English, French, Spanish and Chinese, other language is translated by AI and machine. Join the translation group to help us translating the app.\nIf your OS does not have the language pack, the app language won’t take effect after changing.\nPlaylist sync\rOnline playlist and favorite list added by users can be synced between devices like Xbox, desktop and tablet via OneDrive.\nYou have to manually click upload and download between devices. Auto sync is under development.\nCurrently this feature is only available for IPTV Plus.\nPlayback settings\rPlayback engine\rPlayback engine is the core player behind streaming. If you encounter any issue while playing some live stream, you may change the playback engine.\n1: VLC has better graphics and source playbility support.\n2: Native system player has better RAM memory usage management and stability management.\n3: FFMpeg has better stream support but consume more RAM memory usage.\nElectronic programme guide\rCustom epg required a external xml link which may be provided by your IPTV Provider or you may search it online.\nIt will display upcoming programmes after url has been setted.\nAuto sleep\rApp supports auto shut down after certain amount time.\nList settings\rDefault list view\rIn channel list, default it displayed as single line list.\nThere is an Grid option to show it with programme logo.\nAuto detect latency\rThere may be some situations which you retrieve unreliable m3u list online.\nMany of the channels within it may be unavailable in your region.\nTurn on this feature will auto hide those channels after loading the online list.\nUpdate frequency\rEvery day option enables cache the online list every day without loading the list every time.\nRead More\rWiki: Electronic program guide "},"title":"Configurations"},"/docs/iptv/get-started/":{"data":{"":"","1-what-is-an-iptv-player#1. What is an IPTV Player":"","2-what-is-m3u-and-where-to-get-it-legitimately#2. What is M3U, and Where to Get It Legitimately":"","3-how-to-use-m3u-in-iptv-fluent#3. How to Use M3U in IPTV Fluent":"","read-more#Read More":"Please be patient if you are new to IPTV. IPTV Fluent does not provide in-box TV channels.\n1. What is an IPTV Player\rAn IPTV Player is a software tool that allows users to stream television content over the internet.\nIt supports various formats for live channels and video-on-demand content, providing a flexible interface to browse and watch media from around the world.\n2. What is M3U, and Where to Get It Legitimately\rM3U is a playlist file format commonly used to store IPTV channel lists.\nIt contains URLs for streaming content and can be obtained from legitimate sources like licensed IPTV providers or broadcasters.\nAlways ensure you are using legally acquired M3U files to avoid copyright violations.\n3. How to Use M3U in IPTV Fluent\rTo start using IPTV Fluent, simply enter the M3U URL in the search bar.\nThe software will automatically load the channels and content associated with the M3U file, allowing you to browse and stream with ease.\nRead More\rIPTV m3u list example in Github IPTV history by Wikipedia "},"title":"Get Started"},"/docs/iptv/iptvplus/":{"data":{"":"","pricing#Pricing":"","subscription-cancellation#Subscription cancellation":"IPTV Plus has enhanced features built for IPTV Fluent.\nWhat’s so special?\rSo what’s the diffrence IPTV Plus from other IPTV apps on Windows you may ask.\nIPTV Fluent and Plus are constantly receiving new features and bug fixes during the development.\nWhat does Plus offer?\rPricing\rIPTV Plus offer 2 options. Lifetime and Subscription.\nFor subscription it will cost $0.99(VAT excluded) for 10 devices license. Plus feature will be locked after subscription expired. For lifetime it will cost $12(VAT excluded) for 10 devices license. The plus function offered in two versions is identical.\nSubscription cancellation\rSign into account via official msft page to cancel the IPTV plus.\nMicrosoft Subscription","what-does-plus-offer#What does Plus offer?":"","whats-so-special#What\u0026rsquo;s so special?":""},"title":"IPTV Plus"},"/docs/iptv/updatelog/":{"data":{"":"","v1011#v1.0.11":"v1.0.21\rRelease date: TBD\nFeature: Remote support(Kiosk mode) Feature: Add custom auto sleep time in settings v1.0.20\rRelease date: 2024/8/9\nFeature: More language support v1.0.19\rRelease date: 2024/8/2\nBug fixes: Fix unable to switch channel under VLC player engine v1.0.18\rRelease date: 2024/8/2\nFeature: Cache online list Feature: New language support v1.0.17\rRelease date: 2024/7/29\nFeature: Add FFmpeg as video engine Feature: Background audio play using native engine on Xbox Bug fixes: Fix some video playback issue using native engine Bug fixes: UI fixes under small window v1.0.16\rRelease date: 2024/7/26\nFeature: Add extream codes parser Feature: Add txt file parse Feature: Change default list/grid Bug fixes: Blade bar ui fix Bug fixes: Fix some circumstances which stuck in fullscreen Bug fixes: Fix some circumstances which unable to enter compact mode under some channels v1.0.15\rRelease date: 2024/7/22\nFeature: Stand alone EPG page Feature: New video info in blade bar Feature: Change stream video track Feature: Change stream audio track Feature: Change stream subtitle Feature: Option to enable hardware decoding Bug fixes: EPG list for different time zones Bug fixes: Video restart after pausing and replaying the VOD v1.0.14\rRelease date: 2024/7/17\nFeature: New ‘LIVE’ icon in video page Feature: New blade right bar in video page Feature: Redeigned EPG list UI in video page Feature: New time finder for VOD in video page Feature: Grid list in channels page with icon Feature: New library page Feature: Rename saved online list in library page Feature: Reorder saved online list in library page Feature: UI tweaks in Settings page Bug fixes: Switch to online list when refreshes in channels page v1.0.11\rBug fixes: App crashes after switching the channel ","v1014#v1.0.14":"","v1015#v1.0.15":"","v1016#v1.0.16":"","v1017#v1.0.17":"","v1018#v1.0.18":"","v1019#v1.0.19":"","v1020#v1.0.20":"","v1021#v1.0.21":""},"title":"Update Log"},"/showcase/":{"data":{"":"\rProjects powered by JimmyRespawn\rMusicloud\rSticky Noter\rLetter Counter\rStage1st\rTGFC"},"title":"Showcase"}}